_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_25 (Dense)             (None, 90)                180       
_________________________________________________________________
activation_25 (Activation)   (None, 90)                0         
_________________________________________________________________
batch_normalization_17 (Batc (None, 90)                360       
_________________________________________________________________
dense_26 (Dense)             (None, 90)                8190      
_________________________________________________________________
activation_26 (Activation)   (None, 90)                0         
_________________________________________________________________
batch_normalization_18 (Batc (None, 90)                360       
_________________________________________________________________
dense_27 (Dense)             (None, 1)                 91        
_________________________________________________________________
activation_27 (Activation)   (None, 1)                 0         
=================================================================
Total params: 9,181
Trainable params: 8,821
Non-trainable params: 360
_________________________________________________________________
