_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_28 (Dense)             (None, 100)               200       
_________________________________________________________________
activation_28 (Activation)   (None, 100)               0         
_________________________________________________________________
batch_normalization_19 (Batc (None, 100)               400       
_________________________________________________________________
dense_29 (Dense)             (None, 100)               10100     
_________________________________________________________________
activation_29 (Activation)   (None, 100)               0         
_________________________________________________________________
batch_normalization_20 (Batc (None, 100)               400       
_________________________________________________________________
dense_30 (Dense)             (None, 1)                 101       
_________________________________________________________________
activation_30 (Activation)   (None, 1)                 0         
=================================================================
Total params: 11,201
Trainable params: 10,801
Non-trainable params: 400
_________________________________________________________________
