_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_10 (Dense)             (None, 40)                120       
_________________________________________________________________
activation_10 (Activation)   (None, 40)                0         
_________________________________________________________________
batch_normalization_7 (Batch (None, 40)                160       
_________________________________________________________________
dense_11 (Dense)             (None, 40)                1640      
_________________________________________________________________
activation_11 (Activation)   (None, 40)                0         
_________________________________________________________________
batch_normalization_8 (Batch (None, 40)                160       
_________________________________________________________________
dense_12 (Dense)             (None, 1)                 41        
_________________________________________________________________
activation_12 (Activation)   (None, 1)                 0         
=================================================================
Total params: 2,121
Trainable params: 1,961
Non-trainable params: 160
_________________________________________________________________
