_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_4 (Dense)              (None, 20)                60        
_________________________________________________________________
activation_4 (Activation)    (None, 20)                0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 20)                80        
_________________________________________________________________
dense_5 (Dense)              (None, 20)                420       
_________________________________________________________________
activation_5 (Activation)    (None, 20)                0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 20)                80        
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 21        
_________________________________________________________________
activation_6 (Activation)    (None, 1)                 0         
=================================================================
Total params: 661
Trainable params: 581
Non-trainable params: 80
_________________________________________________________________
