_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_22 (Dense)             (None, 80)                240       
_________________________________________________________________
activation_22 (Activation)   (None, 80)                0         
_________________________________________________________________
batch_normalization_15 (Batc (None, 80)                320       
_________________________________________________________________
dense_23 (Dense)             (None, 80)                6480      
_________________________________________________________________
activation_23 (Activation)   (None, 80)                0         
_________________________________________________________________
batch_normalization_16 (Batc (None, 80)                320       
_________________________________________________________________
dense_24 (Dense)             (None, 1)                 81        
_________________________________________________________________
activation_24 (Activation)   (None, 1)                 0         
=================================================================
Total params: 7,441
Trainable params: 7,121
Non-trainable params: 320
_________________________________________________________________
