_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_13 (Dense)             (None, 50)                150       
_________________________________________________________________
activation_13 (Activation)   (None, 50)                0         
_________________________________________________________________
batch_normalization_9 (Batch (None, 50)                200       
_________________________________________________________________
dense_14 (Dense)             (None, 50)                2550      
_________________________________________________________________
activation_14 (Activation)   (None, 50)                0         
_________________________________________________________________
batch_normalization_10 (Batc (None, 50)                200       
_________________________________________________________________
dense_15 (Dense)             (None, 1)                 51        
_________________________________________________________________
activation_15 (Activation)   (None, 1)                 0         
=================================================================
Total params: 3,151
Trainable params: 2,951
Non-trainable params: 200
_________________________________________________________________
