_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_16 (Dense)             (None, 60)                180       
_________________________________________________________________
activation_16 (Activation)   (None, 60)                0         
_________________________________________________________________
batch_normalization_11 (Batc (None, 60)                240       
_________________________________________________________________
dense_17 (Dense)             (None, 60)                3660      
_________________________________________________________________
activation_17 (Activation)   (None, 60)                0         
_________________________________________________________________
batch_normalization_12 (Batc (None, 60)                240       
_________________________________________________________________
dense_18 (Dense)             (None, 1)                 61        
_________________________________________________________________
activation_18 (Activation)   (None, 1)                 0         
=================================================================
Total params: 4,381
Trainable params: 4,141
Non-trainable params: 240
_________________________________________________________________
