_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_19 (Dense)             (None, 70)                210       
_________________________________________________________________
activation_19 (Activation)   (None, 70)                0         
_________________________________________________________________
batch_normalization_13 (Batc (None, 70)                280       
_________________________________________________________________
dense_20 (Dense)             (None, 70)                4970      
_________________________________________________________________
activation_20 (Activation)   (None, 70)                0         
_________________________________________________________________
batch_normalization_14 (Batc (None, 70)                280       
_________________________________________________________________
dense_21 (Dense)             (None, 1)                 71        
_________________________________________________________________
activation_21 (Activation)   (None, 1)                 0         
=================================================================
Total params: 5,811
Trainable params: 5,531
Non-trainable params: 280
_________________________________________________________________
