_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_7 (Dense)              (None, 30)                90        
_________________________________________________________________
activation_7 (Activation)    (None, 30)                0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 30)                120       
_________________________________________________________________
dense_8 (Dense)              (None, 30)                930       
_________________________________________________________________
activation_8 (Activation)    (None, 30)                0         
_________________________________________________________________
batch_normalization_6 (Batch (None, 30)                120       
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 31        
_________________________________________________________________
activation_9 (Activation)    (None, 1)                 0         
=================================================================
Total params: 1,291
Trainable params: 1,171
Non-trainable params: 120
_________________________________________________________________
