_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_13 (Dense)             (None, 70)                140       
_________________________________________________________________
activation_13 (Activation)   (None, 70)                0         
_________________________________________________________________
batch_normalization_7 (Batch (None, 70)                280       
_________________________________________________________________
dense_14 (Dense)             (None, 1)                 71        
_________________________________________________________________
activation_14 (Activation)   (None, 1)                 0         
=================================================================
Total params: 491
Trainable params: 351
Non-trainable params: 140
_________________________________________________________________
