_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_11 (Dense)             (None, 60)                120       
_________________________________________________________________
activation_11 (Activation)   (None, 60)                0         
_________________________________________________________________
batch_normalization_6 (Batch (None, 60)                240       
_________________________________________________________________
dense_12 (Dense)             (None, 1)                 61        
_________________________________________________________________
activation_12 (Activation)   (None, 1)                 0         
=================================================================
Total params: 421
Trainable params: 301
Non-trainable params: 120
_________________________________________________________________
