_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_17 (Dense)             (None, 90)                180       
_________________________________________________________________
activation_17 (Activation)   (None, 90)                0         
_________________________________________________________________
batch_normalization_9 (Batch (None, 90)                360       
_________________________________________________________________
dense_18 (Dense)             (None, 1)                 91        
_________________________________________________________________
activation_18 (Activation)   (None, 1)                 0         
=================================================================
Total params: 631
Trainable params: 451
Non-trainable params: 180
_________________________________________________________________
