_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_19 (Dense)             (None, 100)               200       
_________________________________________________________________
activation_19 (Activation)   (None, 100)               0         
_________________________________________________________________
batch_normalization_10 (Batc (None, 100)               400       
_________________________________________________________________
dense_20 (Dense)             (None, 1)                 101       
_________________________________________________________________
activation_20 (Activation)   (None, 1)                 0         
=================================================================
Total params: 701
Trainable params: 501
Non-trainable params: 200
_________________________________________________________________
