_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_3 (Dense)              (None, 20)                40        
_________________________________________________________________
activation_3 (Activation)    (None, 20)                0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 20)                80        
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 21        
_________________________________________________________________
activation_4 (Activation)    (None, 1)                 0         
=================================================================
Total params: 141
Trainable params: 101
Non-trainable params: 40
_________________________________________________________________
