_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_5 (Dense)              (None, 30)                90        
_________________________________________________________________
activation_5 (Activation)    (None, 30)                0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 30)                120       
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 31        
_________________________________________________________________
activation_6 (Activation)    (None, 1)                 0         
=================================================================
Total params: 241
Trainable params: 181
Non-trainable params: 60
_________________________________________________________________
