_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_7 (Dense)              (None, 40)                120       
_________________________________________________________________
activation_7 (Activation)    (None, 40)                0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 40)                160       
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 41        
_________________________________________________________________
activation_8 (Activation)    (None, 1)                 0         
=================================================================
Total params: 321
Trainable params: 241
Non-trainable params: 80
_________________________________________________________________
