_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_15 (Dense)             (None, 80)                240       
_________________________________________________________________
activation_15 (Activation)   (None, 80)                0         
_________________________________________________________________
batch_normalization_8 (Batch (None, 80)                320       
_________________________________________________________________
dense_16 (Dense)             (None, 1)                 81        
_________________________________________________________________
activation_16 (Activation)   (None, 1)                 0         
=================================================================
Total params: 641
Trainable params: 481
Non-trainable params: 160
_________________________________________________________________
